{
  "id": "core-services",
  "title": "What We Do - Core Services",
  "created": "2025-10-05",
  "versions": {
    "concise": {
      "content": "We analyse how things actually work in your organisation before suggesting solutions. Most failures happen when companies copy best practices without adapting them - what works brilliantly somewhere else can create bottlenecks in your context.\n\nWe look across sectors to find approaches that single-industry experts miss.\n\nOur work centres on three areas:\n• **Strategic transformation** - adapting proven approaches to your specific situation\n• **Context analysis** - understanding implementation dynamics before proposing solutions\n• **Cross-sector insights** - pattern recognition from insurance, education, procurement, and beyond\n\nReal examples: Insurance brokerage (150% conversion improvement), education transparency (LSA contract analysis), procurement acceleration (48-hour turnaround vs weeks).\n\nWhat are you working on - think we can help?",
      "use_case": "Quick overview for 'what do you do' queries"
    },

    "detailed": {
      "content": "## What We Do\n\nWe work with mid-market organisations navigating strategic transitions - particularly in regulated industries and tech-enabled services.\n\n**Our approach is simple:** understand your context first, then adapt proven solutions to fit your reality.\n\n## Why Context Matters\n\nMost transformation projects fail because companies apply best practices without adaptation. What works brilliantly at Company A creates bottlenecks at Company B. Same solution, different context, opposite results.\n\nWe've seen this pattern across insurance, education, procurement, and professional services: **generic frameworks rarely fit**.\n\n## How We Work\n\n**1. Context Analysis**\nWe analyse how things actually work in your organisation - not how they should work in theory.\n\n**2. Pattern Recognition**\nWe look across sectors to find approaches that single-industry experience misses. Healthcare solutions can solve insurance problems. Education transparency methods can transform procurement.\n\n**3. Contextual Adaptation**\nWe adapt proven approaches to your specific situation, rather than forcing you into generic frameworks.\n\n## Real Examples\n\n**Insurance Brokerage:** 150% conversion improvement by eliminating 85% unnecessary complexity while preserving valuable logic. £200K+ annual savings.\n\n**Education Transparency:** LSA contract analysis revealing £3,600 student risk through forensic analysis of 75+ sources.\n\n**Procurement Acceleration:** Sports venue catering analysis - 48 hours instead of weeks, £200K+ hidden costs discovered.\n\n## Who We Help\n\nMid-market organisations where:\n• Proven approaches need adapting (not just copying)\n• Strategic transitions require contextual intelligence\n• Cross-sector insights reveal missed opportunities\n• Implementation dynamics determine success\n\n## Team Expertise\n\n**[Lindsay - CTO](javascript:void(0))**: 20+ years FinTech/Enterprise software. Former CTO at Telrock (17 years). Bubble.io Ambassador. Technical architecture and rapid development specialist.\n\n**[Robbie MacIntosh - Operations Director](javascript:void(0))**: Crisis management and operational transformation. \"Is Everyone Safe\" co-founder. Large-scale operations specialist.\n\n**[Spencer - Strategy Director](javascript:void(0))**: AI strategy, brand positioning, cross-sector pattern recognition. Contextual adaptation specialist.\n\nWant to discuss your specific situation? **[Contact us](javascript:void(0))**",
      "use_case": "Comprehensive overview for serious enquiries"
    },

    "triage": {
      "what_we_do": "We analyse how things actually work before suggesting solutions. Most companies fail by copying best practices without adapting them. We look across sectors to find approaches single-industry experts miss.",

      "how_we_work": "Context-first: understand your situation, identify what matters, adapt proven approaches to fit your reality. Not generic frameworks.",

      "who_we_help": "Mid-market organisations navigating strategic transitions, particularly in regulated industries and tech-enabled services. When proven approaches need adapting, not just copying.",

      "typical_projects": "Strategic transformation where context determines success. Examples: Insurance conversion optimization (150% improvement), education transparency (LSA contract analysis), procurement acceleration (48 hours vs weeks). What's your situation?",

      "when_to_engage": "Best when you're evaluating options that worked elsewhere but need adapting. When you want an honest take on implementation dynamics, not a sales pitch.",

      "what_makes_us_different": "Cross-sector pattern recognition. We've seen insurance solutions solve education problems and procurement methods transform professional services. Single-industry consultants miss these connections."
    }
  },

  "keywords": [
    "what do you do",
    "services",
    "what you offer",
    "capabilities",
    "how you work",
    "approach",
    "methodology",
    "who you help",
    "typical projects",
    "what makes you different",
    "why choose you",
    "your background",
    "about you",
    "tell me about"
  ]
}
